README.org
#+OPTIONS: _:nil

* Getting started

  Download
  [[https://github.com/vtex-soft/texsupport.springer-sola/raw/master/release/sola-project-template.zip][sola-project-template]]
  package and unzip it.
  Rename the folder =sola-project-template= to =<your-project-name>=.

* Package content

  - sty/ 
    - ~spr-sola-addons.sty~
    - ~solarphysics.cls~
    - ~orcid.eps~

  - bst/
    - ~spr-mp-sola.bst~ - bibtex style file

  - example/ - Sample paper. It contains useful information about typseting article  with solarphysics class file. 
    - ~sola_example_6.tex~
    - ~sola_example_6.pdf~
    - ~sola_example_6.bbl~
    - ~bib/sola_bibliography_example.bib~ - bibliography database
    - ~img/fig1*.eps~

  - template/ 
    - ~template.tex~            - template file 
    - ~sola_example_labels.txt~ - extra information for labelling 
    - ~sola_keyword_list.txt~   - keyword list
      
* Submission

  Submit one single file as a zip archive. 
  Pack your root folder =<your-project-name>= with files and subfolders.
  
* Bug reports

  Please submit bug report or feature requests
  at [[https://github.com/vtex-soft/texsupport.springer-sola/issues][github page]].
