README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7df5908">1. Getting started</a></li>
<li><a href="#org735d9d7">2. Package content</a></li>
<li><a href="#orgcaa3315">3. Submission</a></li>
<li><a href="#org87cf854">4. Bug reports</a></li>
</ul>
</div>
</div>


<a id="org7df5908"></a>

# Getting started

Download
[sola-project-template](https://github.com/vtex-soft/texsupport.springer-sola/raw/master/release/sola-project-template.zip)
package and unzip it.
Rename the folder `sola-project-template` to `<your-project-name>`.


<a id="org735d9d7"></a>

# Package content

-   sty/ 
    -   `spr-sola-addons.sty`
    -   `solarphysics.cls`
    -   `orcid.eps`

-   bst/
    -   `spr-mp-sola.bst` - bibtex style file

-   example/ - Sample paper. It contains useful information about typseting article  with solarphysics class file. 
    -   `sola_example_6.tex`
    -   `sola_example_6.pdf`
    -   `sola_example_6.bbl`
    -   `bib/sola_bibliography_example.bib` - bibliography database
    -   `img/fig1*.eps`

-   template/ 
    -   `template.tex`            - template file
    -   `sola_example_labels.txt` - extra information for labelling
    -   `sola_keyword_list.txt`   - keyword list


<a id="orgcaa3315"></a>

# Submission

Submit one single file as a zip archive. 
Pack your root folder `<your-project-name>` with files and subfolders.


<a id="org87cf854"></a>

# Bug reports

Please submit bug report or feature requests
at [github page](https://github.com/vtex-soft/texsupport.springer-sola/issues).

